import 'package:travel/gen/assets.gen.dart';

class TravelModel {
  final String name;
  final String location;
  final String image;
  final String distance;
  final String temp;
  final String raing;
  final String discription;
  final String price;

  TravelModel(
      {required this.name,
      required this.location,
      required this.image,
      required this.distance,
      required this.temp,
      required this.raing,
      required this.discription,
      required this.price});
}

List<TravelModel> travelList = [
  TravelModel(
      name: 'نیویورک',
      location: 'آمریکا',
      image: Assets.images.newyork.path,
      distance: '7',
      temp: '30',
      raing: '5',
      discription:
          'شهر نیویورک، پایتخت اقتصادی، تجاری و فرهنگی ایالات متحده آمریکا است. این شهر دارای جاذبه‌های تاریخی، فرهنگی و سرگرمی بسیار متنوع است؛ از جمله نمایشگاه‌های هنری، موزه‌ها، برج‌های معروف نظیر برج آزادی و برج امپایر استیت، ساحل مشهور کانی اسلند، سینماها، تئاترها، مراکز خرید، مجتمع‌های تفریحی و توریستی و غیره. همچنین نیویورک شهری بسیار شلوغ و پر جریان از لحاظ ترافیک و نوسانات جمعیت است. در کل، نیویورک یکی از پر جذاب‌ترین و پرسرمایه‌گذاری‌ترین شهرهای جهان است.',
      price: '30000'),
  TravelModel(
      name: 'تهران',
      location: 'ایران',
      image: Assets.images.tehran.path,
      distance: '8',
      temp: '40',
      raing: '6',
      discription:
          'تهران شهری در ایران است که به عنوان پایتخت این کشور شناخته می‌شود. تهران شهری پویا با فرهنگی چندگانه است که ارائه دهنده مزیت های متعددی به زائرین و توریست ها می باشد. از دیدگاه گردشگری، تهران بخش خود، دارای مجموعه های تصمیم گیری و مراکز فرهنگی متعددی از قبیل تالار ملت، آثار باستانی گمرک، خانه های بهشتی قاجار و موزه های مختلف است. بازار گرمی‌در و بازار پاشا و میدان انقلاب از دیگر جاذبه‌های توریستی تهران است. تهران همچنین مرکز تجارت، اقتصادی، فرهنگی ج1سد و اهمیتی این شهر از نظر اقتصادی در برابر دیگر شهرهای ایران بسیار مهم است، به عنوان مرکز تجارت و بازرگانی در ایران شناخته می‌شود.',
      price: '40000'),
  TravelModel(
      name: 'پاریس',
      location: 'فرانسه',
      image: Assets.images.paris.path,
      distance: '9',
      temp: '50',
      raing: '7',
      discription:
          'پاریس شهری بزرگ در فرانسه است که به عنوان پایتخت فرانسه شناخته می‌شود و یکی از جذابیت‌های بسیار برای گردشگران در سراسر جهان است. این شهر به علت وجود برج ایفل، موزه‌های هنری معروف، جنبه‌های تاریخی و فرهنگی گسترده، فرهنگ صبحانه و شیرینی‌های خوشمزه‌ای که در آن وجود دارد، شناخته شده است. برج ایفل، نشان از امتیازات معماری مدرن پاریس و نماد آن است. موزه های معروف پاریس عبارتند از موزه نوفل، موزه لوور، باغ حشایش‌های ورسای و موزه دولتی پومپیدو. فرهنگ و سرگرمی نیز در پاریس بسیار گسترده و متنوع هستند، به عنوان نمونه: کافه‌های برجسته، رستوران های معروف، شیرینی‌فروشی‌ها و صبحانه های روتینی هستند. همچنین شهر دارای بازارهای مختلفی از جمله بازار اسکاژ و بازار منن سنت ژرمن است. در کل پاریس شهری زیبا و تاریخی است که به عنوان یکی از بهترین مقاصد گردشگری جهان محسوب می‌شود.',
      price: '50000'),
  TravelModel(
      name: 'رم',
      location: 'ایتالیا',
      image: Assets.images.rome.path,
      distance: '10',
      temp: '50',
      raing: '80',
      discription:
          'رم یکی از شهرهای مهم ایتالیا است که در منطقه لاتیوم واقع شده و عاصمه ایتالیا نیز محسوب می‌شود. رم شهری با تاریخ 3000 ساله و حضور پرشور جمعیت مسلمان، یهودی، مسیحی و آثار باستانی فراوان تاریخی و معماری است. از مهمترین جاذبه‌های گردشگری رم می‌توان به کلیسای سنت پل، کلیسای واتیکان، کلیسای سنت پیتر، آرش‌های رمی، کلیسای سنت ماری و برج خندق والد نام برد. قلعه سنت‌آنژلو و منطقه‌های تفریحی از دیگر جاذبه‌های شهر رم هستند. شهر رم همچنین به عنوان شهر باستانی شناخته می‌شود و برای آثار باستانی خود که شامل کلیساها، فوروم‌ها و بازارها و معابد رومی‌ها هستند شناخته شده است.',
      price: '850000'),
];
